lixc929/hardware/firmware/ch585_legacy/rf_rx_usbhs/APP/USB/ch585_usbhs_kbd.c
                                case USB_GET_CONFIGURATION:
                                    USBHS_EP0_Buf[0] = USBHS_DevConfig;
                                    if (USBHS_SetupReqLen > 1) USBHS_SetupReqLen = 1;
                                    break;

                                case USB_SET_CONFIGURATION:
                                    USBHS_DevConfig     = (uint8_t)(USBHS_SetupReqValue & 0xFF);
                                    USBHS_DevEnumStatus = 0x01;
                                    break;

                                case USB_CLEAR_FEATURE:
                                    if ((USBHS_SetupReqType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_DEVICE) {
                                        if ((uint8_t)(USBHS_SetupReqValue & 0xFF) == 0x01)
                                            USBHS_DevSleepStatus &= ~0x01;
                                        else
                                            errflag = 0xFF;
                                    } else if ((USBHS_SetupReqType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP) {
                                        if ((uint8_t)(USBHS_SetupReqValue & 0xFF) == USB_REQ_FEAT_ENDP_HALT) {
                                            switch ((uint8_t)(USBHS_SetupReqIndex & 0xFF)) {
                                                case (DEF_UEP_IN | DEF_UEP1):
                                                    R8_U2EP1_TX_CTRL = USBHS_UEP_T_TOG_DATA0 | USBHS_UEP_T_RES_NAK;
                                                    break;
                                                case (DEF_UEP_IN | DEF_UEP2):
                                                    R8_U2EP2_TX_CTRL = USBHS_UEP_T_TOG_DATA0 | USBHS_UEP_T_RES_NAK;
                                                    break;
                                                case (DEF_UEP_IN | DEF_UEP3):
                                                    R8_U2EP3_TX_CTRL = USBHS_UEP_T_TOG_DATA0 | USBHS_UEP_T_RES_NAK;
                                                    break;
                                                case DEF_UEP3:
                                                    R8_U2EP3_RX_CTRL = USBHS_UEP_R_TOG_DATA0 | USBHS_UEP_R_RES_ACK;
                                                    break;
                                                default:
                                                    errflag = 0xFF;
                                                    break;
                                            }
                                        } else {
                                            errflag = 0xFF;
                                        }
                                    } else {
                                        errflag = 0xFF;
                                    }
                                    break;

                                case USB_SET_FEATURE:
                                    if ((USBHS_SetupReqType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_DEVICE) {
                                        if ((uint8_t)(USBHS_SetupReqValue & 0xFF) == USB_REQ_FEAT_REMOTE_WAKEUP) {
                                            if (MyCfgDescr[7] & 0x20)
                                                USBHS_DevSleepStatus |= 0x01;
                                            else
                                                errflag = 0xFF;
                                        } else {
                                            errflag = 0xFF;
                                        }
                                    } else if ((USBHS_SetupReqType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP) {
                                        if ((uint8_t)(USBHS_SetupReqValue & 0xFF) == USB_REQ_FEAT_ENDP_HALT) {
                                            switch ((uint8_t)(USBHS_SetupReqIndex & 0xFF)) {
                                                case (DEF_UEP_IN | DEF_UEP1):
                                                    R8_U2EP1_TX_CTRL = (R8_U2EP1_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_STALL;
                                                    break;
                                                case (DEF_UEP_IN | DEF_UEP2):
                                                    R8_U2EP2_TX_CTRL = (R8_U2EP2_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_STALL;
                                                    break;
                                                case (DEF_UEP_IN | DEF_UEP3):
                                                    R8_U2EP3_TX_CTRL = (R8_U2EP3_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_STALL;
                                                    break;
                                                default:
                                                    errflag = 0xFF;
                                                    break;
                                            }
                                        }
                                    }
                                    break;

                                case USB_GET_INTERFACE:
                                    USBHS_EP0_Buf[0] = 0x00;
                                    if (USBHS_SetupReqLen > 1) USBHS_SetupReqLen = 1;
                                    break;

                                case USB_SET_INTERFACE:
                                    break;

                                case USB_GET_STATUS:
                                    USBHS_EP0_Buf[0] = 0x00;
                                    USBHS_EP0_Buf[1] = 0x00;
                                    if ((USBHS_SetupReqType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_DEVICE) {
                                        if (USBHS_DevSleepStatus & 0x01)
                                            USBHS_EP0_Buf[0] = 0x02;
                                    } else if ((USBHS_SetupReqType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP) {
                                        uint8_t ep = (uint8_t)(USBHS_SetupReqIndex & 0xFF);
                                        if (ep == (DEF_UEP_IN | DEF_UEP1)) {
                                            if ((R8_U2EP1_TX_CTRL & USBHS_UEP_T_RES_MASK) == USBHS_UEP_T_RES_STALL)
                                                USBHS_EP0_Buf[0] = 0x01;
                                        } else if (ep == (DEF_UEP_IN | DEF_UEP2)) {
                                            if ((R8_U2EP2_TX_CTRL & USBHS_UEP_T_RES_MASK) == USBHS_UEP_T_RES_STALL)
                                                USBHS_EP0_Buf[0] = 0x01;
                                        } else if (ep == (DEF_UEP_IN | DEF_UEP3)) {
                                            if ((R8_U2EP3_TX_CTRL & USBHS_UEP_T_RES_MASK) == USBHS_UEP_T_RES_STALL)
                                                USBHS_EP0_Buf[0] = 0x01;
                                        } else {
                                            errflag = 0xFF;
                                        }
                                    } else {
                                        errflag = 0xFF;
                                    }
                                    if (USBHS_SetupReqLen > 2) USBHS_SetupReqLen = 2;
                                    break;

                                default:
                                    errflag = 0xFF;
                                    break;
                            }
                        }

                        /* 错误：STALL；正常：开始数据阶段 */
                        if (errflag == 0xFF) {
                            R8_U2EP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_STALL;
                            R8_U2EP0_RX_CTRL = USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_STALL;
                        } else {
                            if (USBHS_SetupReqType & DEF_UEP_IN) {
                                len = (USBHS_SetupReqLen > DEF_USBD_UEP0_SIZE)
                                      ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                                USBHS_SetupReqLen -= len;
                                R16_U2EP0_T_LEN  = len;
                                R8_U2EP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_ACK;
                            } else {
                                if (USBHS_SetupReqLen == 0) {
                                    R16_U2EP0_T_LEN  = 0;
                                    R8_U2EP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_ACK;
                                } else {
                                    R8_U2EP0_RX_CTRL = USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_ACK;
                                }
                            }
                        }
                    } else {
                        /* EP0 OUT 数据阶段（类请求写入）*/
                        R8_U2EP0_RX_CTRL = USBHS_UEP_R_RES_NAK;
                        if ((USBHS_SetupReqType & USB_REQ_TYP_MASK) == USB_REQ_TYP_CLASS) {
                            /* HID SET_REPORT — 忽略 LED 输出报告（键盘无 LED 硬件）*/
                        }
                        if (USBHS_SetupReqLen == 0) {
                            R16_U2EP0_T_LEN  = 0;
                            R8_U2EP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_ACK;
                        }
                    }
                    R8_U2EP0_RX_CTRL &= ~USBHS_UEP_R_DONE;
                    break;

                case DEF_UEP3:
                    /* EP3 OUT — 接收配置命令包 */
                    {
                        uint16_t rx_len = R16_U2EP3_RX_LEN;
                        if (rx_len > 0 && rx_len <= DEF_USB_EP3_HS_SIZE) {
                            memset(USBHS_EP3_TX_Buf, 0, DEF_USB_EP3_HS_SIZE);
                            Config_ProcessUSBCommand(USBHS_EP3_RX_Buf, USBHS_EP3_TX_Buf);
                        }
                        R8_U2EP3_RX_CTRL = (R8_U2EP3_RX_CTRL & ~USBHS_UEP_R_RES_MASK) | USBHS_UEP_R_RES_ACK;
                        R8_U2EP3_RX_CTRL ^= USBHS_UEP_R_TOG_DATA1;
                        R8_U2EP3_RX_CTRL &= ~USBHS_UEP_R_DONE;
                    }
                    break;

                default:
                    break;
            }
        } else {
            /* ── IN 事务完成 ── */
            switch (endp_num) {
                case DEF_UEP0:
                    if (USBHS_SetupReqLen == 0) {
                        R8_U2EP0_RX_CTRL = USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_ACK;
                    }
                    if ((USBHS_SetupReqType & USB_REQ_TYP_MASK) == USB_REQ_TYP_STANDARD) {
                        switch (USBHS_SetupReqCode) {
                            case USB_GET_DESCRIPTOR:
                                len = (USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE)
                                      ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                                memcpy(USBHS_EP0_Buf, pUSBHS_Descr, len);
                                USBHS_SetupReqLen -= len;
                                pUSBHS_Descr      += len;
                                R16_U2EP0_T_LEN   = len;
                                R8_U2EP0_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                                R8_U2EP0_TX_CTRL  = (R8_U2EP0_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_ACK;
                                break;
                            case USB_SET_ADDRESS:
                                R8_USB2_DEV_AD = USBHS_DevAddr;
                                break;
                            default:
                                R16_U2EP0_T_LEN = 0;
                                break;
                        }
                    }
                    R8_U2EP0_TX_CTRL &= ~USBHS_UEP_T_DONE;
                    break;

                case DEF_UEP1:
                    R8_U2EP1_TX_CTRL  = (R8_U2EP1_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_NAK;
                    R8_U2EP1_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                    USBHS_Endp_Busy[DEF_UEP1] &= ~DEF_UEP_BUSY;
                    R8_U2EP1_TX_CTRL &= ~USBHS_UEP_T_DONE;
                    break;

