lixc929/hardware/firmware/ch585_legacy/rf_rx_usbhs/APP/USB/ch585_usbhs_kbd.c
                case DEF_UEP2:
                    R8_U2EP2_TX_CTRL  = (R8_U2EP2_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_NAK;
                    R8_U2EP2_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                    USBHS_Endp_Busy[DEF_UEP2] &= ~DEF_UEP_BUSY;
                    R8_U2EP2_TX_CTRL &= ~USBHS_UEP_T_DONE;
                    break;

                case DEF_UEP3:
                    R8_U2EP3_TX_CTRL  = (R8_U2EP3_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_NAK;
                    R8_U2EP3_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                    USBHS_Endp_Busy[DEF_UEP3] &= ~DEF_UEP_BUSY;
                    R8_U2EP3_TX_CTRL &= ~USBHS_UEP_T_DONE;
                    /* 通知上层EP3发送完成 */
                    extern void USB_HID_EP3_Complete(void);
                    USB_HID_EP3_Complete();
                    break;

                default:
                    break;
            }
        }
    } else if (intflag & USBHS_UDIF_LINK_RDY) {
        R8_USB2_INT_FG = USBHS_UDIF_LINK_RDY;
    } else if (intflag & USBHS_UDIF_SUSPEND) {
        R8_USB2_INT_FG = USBHS_UDIF_SUSPEND;
        if (R8_USB2_MIS_ST & USBHS_UDMS_SUSPEND) {
            USBHS_DevSleepStatus |= 0x02;
        } else {
            USBHS_DevSleepStatus &= ~0x02;
        }
    } else if (intflag & USBHS_UDIF_BUS_RST) {
        USBHS_DevConfig     = 0;
        USBHS_DevAddr       = 0;
        USBHS_DevSleepStatus = 0;
        USBHS_DevEnumStatus  = 0;
        R8_USB2_DEV_AD = 0;
        USBHS_KBD_Endp_Init();
        R8_USB2_INT_FG = USBHS_UDIF_BUS_RST;
    } else {
        R8_USB2_INT_FG = intflag;
    }
}
